Autodesk.Revit.DB.ExternalData.CoordinationModelLinkOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.ExternalData.CoordinationModelLinkOptions.Positioning
Placement option for Coordination Model linking.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2026.3

Autodesk.Revit.DB.ExternalData.CoordinationModelLinkOptions.#ctor
Constructs a default instance of Coordination Model link options with the default CoordinationModelPositioning.
The default CoordinationModelPositioning is OriginToInternalOrigin.
Since:
2026.3

Autodesk.Revit.DB.ExternalData.CoordinationModelLinkOptions
A class containing link options for Coordination Models.
Since:
2026.3